fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>DefinedType.ВКМ_ДенежнаяСумма</types>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛ</name>
      <type>
        <types>DefinedType.ВКМ_ДенежнаяСумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОтРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>DefinedType.ВКМ_ДенежнаяСумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.ВКМ_ДенежнаяСумма</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>DefinedType.ВКМ_ДенежнаяСумма</types>
    </type>
  </resources>
  <resources>
    <name>ДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>DefinedType.ВКМ_ДенежнаяСумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>DefinedType.ВКМ_ДенежнаяСумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ГрафикиРаботы/ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикиРаботы</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НДФЛ = Константы.ВКМ_ПроцентНДФЛ.Получить();

КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеНачисления

&НаКлиенте
Процедура ОсновныеНачисленияРеквизитПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеНачисления.ТекущиеДанные;
	Если ТекущиеДанные.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад") Тогда
		ТекущиеДанные.НДФЛ = ТекущиеДанные.Оклад * (НДФЛ / 100);
		ТекущиеДанные.Результат = ТекущиеДанные.Оклад - ТекущиеДанные.НДФЛ;
		ТекущиеДанные.ДнейОтпуска = 0;
	ИначеЕсли ТекущиеДанные.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск") Тогда
		ТекущиеДанные = Элементы.ОсновныеНачисления.ТекущиеДанные;
		Сотрудник = ТекущиеДанные.Сотрудник;
		ДатаОкончания = ТекущиеДанные.ДатаОкончания;
		ДатаНачала = ТекущиеДанные.ДатаНачала;
		ПроцентОтРабот = ОсновныеНачисленияСотрудникПриИзмененииНаСервере(Сотрудник, ДатаОкончания);

		Если ПроцентОтРабот = Неопределено Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(
				"По сотруднику %1 не заполнены условия оплаты в регистре сведений Условия оплаты сотрудников",
				Сотрудник));
			Возврат;
		Иначе
			ТекущиеДанные.ПроцентОтРабот = ПроцентОтРабот;
		КонецЕсли;

		Структура = ВычислениеСуммыОтпуска(ДатаНачала, ДатаОкончания, Сотрудник);
		Для Каждого Строка Из Структура Цикл

			Если Строка.Ключ = "ОбщаяСумма" Тогда
				ОбщаяСумма = Строка.Значение;
			ИначеЕсли Строка.Ключ = "КоличествоДнейОтпуска" Тогда
				КоличествоДнейОтпуска = Строка.Значение;
			ИначеЕсли Строка.Ключ = "КоличествоРабочихДней" Тогда
				КоличествоРабочихДней = Строка.Значение;
			КонецЕсли;								
		КонецЦикла;

		ТекущиеДанные.ДнейОтпуска = КоличествоДнейОтпуска;
		ТекущиеДанные.Оклад = (ОбщаяСумма / КоличествоРабочихДней) * КоличествоДнейОтпуска;
		ТекущиеДанные.НДФЛ = ТекущиеДанные.Оклад * (НДФЛ / 100);
		ТекущиеДанные.Результат = ТекущиеДанные.Оклад - ТекущиеДанные.НДФЛ;

	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ОсновныеНачисленияВидРасчетаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеНачисления.ТекущиеДанные;
	Если ТекущиеДанные.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад") Тогда
		ТекущиеДанные.НДФЛ = ТекущиеДанные.Оклад * (НДФЛ / 100);
		ТекущиеДанные.Результат = ТекущиеДанные.Оклад - ТекущиеДанные.НДФЛ;
	ИначеЕсли ТекущиеДанные.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск") Тогда
		ТекущиеДанные = Элементы.ОсновныеНачисления.ТекущиеДанные;
		Сотрудник = ТекущиеДанные.Сотрудник;
		ДатаОкончания = ТекущиеДанные.ДатаОкончания;
		ДатаНачала = ТекущиеДанные.ДатаНачала;
		ПроцентОтРабот = ОсновныеНачисленияСотрудникПриИзмененииНаСервере(Сотрудник, ДатаОкончания);

		Если ПроцентОтРабот = Неопределено Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(
				"По сотруднику %1 не заполнены условия оплаты в регистре сведений Условия оплаты сотрудников",
				Сотрудник));
			Возврат;
		Иначе
			ТекущиеДанные.ПроцентОтРабот = ПроцентОтРабот;
		КонецЕсли;

		Структура = ВычислениеСуммыОтпуска(ДатаНачала, ДатаОкончания, Сотрудник);
		Для Каждого Строка Из Структура Цикл

			Если Строка.Ключ = "ОбщаяСумма" Тогда
				ОбщаяСумма = Строка.Значение;
			ИначеЕсли Строка.Ключ = "КоличествоДнейОтпуска" Тогда
				КоличествоДнейОтпуска = Строка.Значение;
			ИначеЕсли Строка.Ключ = "КоличествоРабочихДней" Тогда
				КоличествоРабочихДней = Строка.Значение;
			КонецЕсли;	
							
		КонецЦикла;

		ТекущиеДанные.ДнейОтпуска = КоличествоДнейОтпуска;
		ТекущиеДанные.Оклад = (ОбщаяСумма / КоличествоРабочихДней) * КоличествоДнейОтпуска;
		ТекущиеДанные.НДФЛ = ТекущиеДанные.Оклад * (НДФЛ / 100);
		ТекущиеДанные.Результат = ТекущиеДанные.Оклад - ТекущиеДанные.НДФЛ;

	КонецЕсли;
	

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ОсновныеНачисленияСотрудникПриИзмененииНаСервере(Сотрудник, ДатаОкончания)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Дата", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Если ВыборкаДетальныеЗаписи = Неопределено Тогда
		Возврат Неопределено;
	Иначе		
		Возврат ВыборкаДетальныеЗаписи.ПроцентОтРабот;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ВычислениеСуммыОтпуска(ДатаНачала, ДатаОкончания, Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК Результат
	|ПОМЕСТИТЬ вт_Оклад
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Сотрудник = &Сотрудник
	|	И ВКМ_ОсновныеНачисления.ПериодДействияНачало >= &ПериодДействияНачало12МесяцевНазад
	|	И ВКМ_ОсновныеНачисления.ПериодДействияКонец <= &ПериодДействияКонецРасчетногоМесяца
	|	И ВКМ_ОсновныеНачисления.ВидРасчета = &ВидРасчета
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОсновныеНачисления.ВидРасчета,
	|	ВКМ_ОсновныеНачисления.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_ДополнительныеНачисления.Результат КАК Результат,
	|	ВКМ_ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации
	|ПОМЕСТИТЬ вт_Премия
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Сотрудник = &Сотрудник
	|	И ВКМ_ДополнительныеНачисления.ПериодРегистрации >= &ПериодДействияНачало12МесяцевНазад
	|	И ВКМ_ДополнительныеНачисления.ПериодРегистрации <= &ПериодДействияКонецРасчетногоМесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот) КАК СуммаКОплатеОборот
	|ПОМЕСТИТЬ вт_ПрочентыОтРабот
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&ПериодДействияНачало12МесяцевНазад, &ПериодДействияКонецРасчетногоМесяца,
	|		Месяц, Сотрудник = &Сотрудник) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ГрафикиРаботы.Значение) КАК Значение
	|ПОМЕСТИТЬ вт_КоличествоРабочихДней
	|ИЗ
	|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
	|ГДЕ
	|	ГрафикиРаботы.Значение = &Значение
	|	И ГрафикиРаботы.Дата >= &ПериодДействияНачало12МесяцевНазад
	|	И ГрафикиРаботы.Дата <= &ПериодДействияКонецРасчетногоМесяца
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботы.ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ГрафикиРаботы.Значение) КАК Значение
	|ПОМЕСТИТЬ вт_КоличествоДнейОтпуска
	|ИЗ
	|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
	|ГДЕ
	|	ГрафикиРаботы.Значение = &Значение
	|	И ГрафикиРаботы.Дата >= &ПериодДействияНачало
	|	И ГрафикиРаботы.Дата <= &ПериодДействияКонец
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботы.ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Оклад.Сотрудник КАК Сотрудник,
	|	вт_Оклад.Результат + вт_Премия.Результат + вт_ПрочентыОтРабот.СуммаКОплатеОборот КАК ОбщаяСумма,
	|	вт_КоличествоРабочихДней.Значение КАК КоличествоРабочихДней,
	|	вт_КоличествоДнейОтпуска.Значение КАК КоличествоДнейОтпуска
	|ИЗ
	|	вт_Оклад КАК вт_Оклад
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Премия КАК вт_Премия
	|		ПО вт_Оклад.Сотрудник = вт_Премия.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ПрочентыОтРабот КАК вт_ПрочентыОтРабот
	|		ПО вт_Оклад.Сотрудник = вт_ПрочентыОтРабот.Сотрудник,
	|	вт_КоличествоРабочихДней КАК вт_КоличествоРабочихДней,
	|	вт_КоличествоДнейОтпуска КАК вт_КоличествоДнейОтпуска";
	
	Период12МесяцевНазадНачало = ДобавитьМесяц(ДатаНачала, -12);
	ПериодДействияКонецРасчетногоМесяца = КонецМесяца(ДатаОкончания);
	Запрос.УстановитьПараметр("ПериодДействияНачало12МесяцевНазад", Период12МесяцевНазадНачало);
	Запрос.УстановитьПараметр("ПериодДействияКонецРасчетногоМесяца", ПериодДействияКонецРасчетногоМесяца);
	Запрос.УстановитьПараметр("ПериодДействияНачало", ДатаНачала);
	Запрос.УстановитьПараметр("ПериодДействияКонец", ДатаОкончания);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Значение", 8);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Структура = Новый Структура;
	Структура.Вставить("ОбщаяСумма", Выборка.ОбщаяСумма);
	Структура.Вставить("КоличествоРабочихДней", Выборка.КоличествоРабочихДней);
	Структура.Вставить("КоличествоДнейОтпуска", Выборка.КоличествоДнейОтпуска);
	
	
	Возврат Структура;
	
				   
КонецФункции
#КонецОбласти
